{
  "ABOUT": {
    "HERO_TITLE": "ABOUT ME",
    "INTRO_H1": "Introduction",
    "INTRO_P": "Hello visitors, my name is Hải Hà (my friends call me Haiko, thus the name of this site), I am originally from Vietnam 🇻🇳, the country, that many know through American movies, usually associated with War ⚔️, but nowadays it is one of the coolest country to visit in the South East Asia, thanks to the beautiful countryside and delicious food. Yes, the famous \"PHO\" 🍜 soup! In fact, it is so beautiful, that many movies, were shot here. The latest film name is \"Kong: Skull Island\", so if you have not seen it yet, please check it out, it's quite a good movie, plus you will see the gorgeous landscape!",
    "MY_STORY_H1": "My Story\n",
    "MY_STORY_P": "The year was 1987, and I was born in Vietnam. I lived there until I was five, so in 1993, I moved to the Czech Republic 🇨🇿with my parents. We've lived in the capital Prague ever since. Why Prague, you may ask? Well, long story short, my parents fell in love in the city, and when they moved back to Vietnam in 1986, the life there was still lacking (economically) comparing to Czechia. Here, I would like to point out that, there are many of my peers with similar story. The reason behind this, was the cooperation agreement between Vietnam and Czechia in the 1950s.",
    "MY_STORY_P2": "So, when I was old enough, my Dad decided, that we should go back to Prague. I remember the first day I've arrived to Prague, it was during the winter 1993 (January or February), it was the first time I saw snow ❄️, and it was so cold, yet I liked it, and will never forget the moment. As a kid, I grew up learning Czech language, it was a natural process for me, the kids learn much faster, you know 😀. I was educated as any other Czech kid, and thanks to my parents support, I've managed to pass all the main types of Czech educational system. At school and during every day life, I got a chance to learn about the culture, the history and habits of the Czech people. On the other side, at home, I was educated with Vietnamese culture, history and habits, plus my parents kept speaking Vietnamese language at home, so this was a great thing for me, because I got to learn both languages naturally.\n\n",
    "MY_STORY_P3": "I forgot to mention that in 1995, my parents invited my uncle Nam (my mother's older brother) from Vietnam, and he stayed with us until 1998, then he had to move back to Hanoi due to family matters. The original plan was to earn enough money, and we would eventually invite my Auntie Cham, and my cousins as well, but sometimes even when you try hard, the plan does not succeed.\n\n",
    "MY_STORY_P4": "You know, when they say life has \"ups and downs\", well up until Christmas of 2014. For me it was usually ups, between here and there sometimes I messed up something or parent's business was not going well (and yeah the business of Vietnamese people since 1950s up until 2010s were generally very bad, usually we would do business such as selling cheap clothes as alternative for Czech people for could not afford to pay for branded clothing, or we would work as cheap labour in factories, which was the main reason why Vietnamese people were actually coming to Czechia in 50s, but more on this topic in another post). Back to the point, none of our fails, would be connected to health, which is actually is the most precious thing each of us has nowadays. If we are healthy we can do anything we want, as long as our lifespan can offer. So, it started with simple coughs for my Dad, and eventually he was diagnosed with Lung Cancer, at first he tried to hide from me and mom, but eventually he told me. To be honest, I've told started to google stuff about his symptoms, and kinda new this was coming, but it was still a shock for me, when my dad told me the truth, and the reason he tried to keep it away from me and mom. He told me that, he was afraid, that my mom would be able to bear the truth, and he thought, she would collapse. So, he wanted, that I would keep the secret from my mom as long as possible. He was basically preparing for the worst, making me emotionally stronger, and he kinda succeeded, because nowadays I don't cry at all, this was critical when I finally told my mom on December 2015, just three months from the day when my Dad passed away. When I told mom the truth, she was really sad, but she kinda knows the whole time, she told me she was curious and checked the internet about my dad's symptoms, and also asked her friends, which some are doctors. She took it really with courage, and I rarely saw her cry during the last few months. My Dad passed away on 3rd of March 2016, he fought the disease bravely for two years. Those were saddest two years period in my life, but it also opened my eyes and let me know, what is truly important for me in life, and I think that since that moment I truly become a grown up man ever since.\n\n",
    "WHAT_I_LIKE_H1": "What I like\n",
    "WHAT_I_LIKE_P": "There are quite a lot of things I enjoy, but these would be on top of my list for sure:\n\n",
    "GAMES_AND_COMPUTERS_H2": "Video Games and Computers\n",
    "GAMES_AND_COMPUTERS_P": "Growing up in the Czech Republic, I was lucky enough to get in touch with Tech in early age. My first Tech was definitely the copy of the 🎮NES system from Nintendo, which my dad bought on my 7th birthday. This system is how I got introduced to Video Games, I've spent countless hours on games like Super Mario Bros, Tetris, Contra, Tanks and all the system's classics available on the Czech market. I was also introduced to Windows 95 and later 98, thanks to my friends. Not that kid as us got a chance to work with computers, but their parents usually rely on them and we just happened to sneak around and play games on computers. 1995 was the year that I was introduced to the Internet and World Wide Web. The first page that my friend showed me was www.seznam.cz, which believe it or not still exists today in Czechia. If you have not idea, it is the Czech version of \"Google\" imagination, so basically a fulltext search engine. Gosh, it reminds me the old times of wired slow phone connection, which tops at 5kb/s speed 😱! Me and my friends, we've mastered all the famous games in this era such as Prince of Persia, Doom, Duke Nukem 3D, Mortal Kombat and so on. 1996 was also the year, when I first saw the famous Sony Playstation One in the store with my dad, man I never forget the feeling, to see and play such advance games, I wanted so much, but we did not have enough money, the console was really expensive (500 USDs, I think today it would cost 700USDs due to inflation, or more). My Dad promised that within two years he would buy it for me, and he did. I got mine on October 1998 as a birthday gift. Trust me, Playstation Nation still flows within me up until this point! As a kid, the only thing, I wanted to do after school was just go to my friend's house and play their games 😀, because we did not own a PC in our house. At least not until 2001, when I got my first one as a birthday gift 😍! Now, finally I didn't have to spent hours playing at my friend's, instead they would come to my place, because suddenly I had the latest and greatest in the hood 😎! Thanks to the experience at my friend's houses, I got to know how to use Windows, my version was the Millennium Edition, which I thought at first that it was great, until I've installed XP 🙈!\n\n",
    "GAMES_AND_COMPUTERS_P2": "During college, I was introduced to the Mac 👨🏻‍💻and iPhone📱from some of my classmates, that managed to bring these toys from USA. Yes, it was the year of 2007, when Steve Jobs introduced the original iPhone. The thing is that, up until this point, Apple was not so common in the Czech Republic, and all my friends usually have Windows and Windows based smartphone or even Symbian from Nokia, yeah those days. So, I also thought that Windows and PC are still superior to the MAC, plus Windows supports more games! The iPhone was a different story, there were nothing like it until this point, I remember, that I really liked it, but the only thing kept me away was again the price, and because I had no idea about Apple philosophy yet, I thought naively that it was basically overpriced. Either way, I was doing side jobs to save up money to buy my first iPhone, but when I got my money, I decided after all the reviews and common sense to put my money into: guess what?, a Windows Phone, the famous HTC Diamond 2. The same thing happened when I was introduced to the iPad 2, I knew I want it so much, but in the end, I bought the Galaxy Tab instead, yeah OMG! Long story short, for very long time I had believed, that Apple was overpriced, and I should invest my money into alternatives, which would give me same performance for less price, even though I liked the products. Best bang for your buck as they say, and that was the reason why I stayed from Apple ecosystem for so long. Little I know that in Tech sometimes, performance ≠ quality. Which is the same for Windows vs Mac, or Android vs iOS.\n\n",
    "GAMES_AND_COMPUTERS_P3": "Up until 2013, when there was really a good deal for the iPad Mini 2, that I really wanted to replace my old Nexus 7 with. Eventually I bought it, and this eventually changed my mind about Apple products. The iOS was really smooth, there were apps that really matter to me, and these apps were not even available on Android. Everything just works, and I didn't have to spent countless hours learning how to ROOT the phone and make it work like I wanted.\n\n",
    "GAMES_AND_COMPUTERS_P4": "Another Milestone for me was the fall of 2013, when I helped my friend to buy MacBook Pro 2013 Late Edition, I got a chance to help him set it up, and somehow I really wanted it. My old PC desktop was getting really slow, and I wanted a new machine. On my birthday, saved up all the money and bought my first MacBook Pro 15\" with top-notch specs. The first few days, I even thought that I made the worst mistake of my life spending so much money on the laptop 🙈! Whereas, I could spend less or for same price buy a beefy top spec PC desktop. I am so glad, that I had made that decision, because the machine worked like a gem! I just recently sold it for the price that you would never get for a PC laptop. That is another thing about Apple products, they do keep their value for very long time! After the Mac, I was completely hooked, and all the rest of Apple products would follow 🙈! I've read all the things there is about Apple history and philosophy, and I found out that I have similar way of thinking, and I really like the brand! I've become literally the \"iSheep\" 🙈!\n\n",
    "GAMES_AND_COMPUTERS_P5": "As you can see, I was heavily inspired by video games, and it is one of my hobby, that I really like, up until this point. Unfortunately, I do not have so much time nowadays, but when I do, I can really enjoy playing newest hit! For computers, I am really grateful for what Steve Jobs and Apple had done for tech world and humanity!\n\n",
    "PHOTOGRAPHY_H2": "Photography",
    "PHOTOGRAPHY_P1": "There was always something about Photography, that I liked. Whether it's the aesthetic or the storytelling itself. I started my journey in 2003 when I first bought my digital camera with 128-MB memory, it was a cheap no name brand, but enough for my purposes, and I spent all the money I had to afford it. It had only 3.2MPX sensor, with some cheap lens mounted on it. It had some semi-manual features, but I had no idea at all, basically a point & shoot to get me started. As any average Joe, I had no idea about terms like SHUTTER, APERTURE, ISO, EXPOSURE and so on. My pictures were terrible, but I just liked them!\n\n",
    "PHOTOGRAPHY_P2": "In 2010, during college days, thanks to the Internet and Lynda.com, I started to learn more professionally about PHOTOGRAPHY, and I got really hooked. I decided save up all my money from the part-time job that I was doing, and on my birthday, me and my dad bought my first D-SLR from Canon, the notorious Canon 50D, with the \"Plastic, Fantastic\" 50-mm F1.8 lens. This was a killer combo, and my pictures were slowly getting better, I was more focused on portraiture, and I even wanted to become a professional photographer, and start shooting Weddings for a living. This dream was wasted, when our flat was robbed during daytime. We were living in one of the worst neighbourhood in Prague since 1995, and these things were normal, we heard about it in the news and TV, but never imagine that this would happen to us. Luckily none of us were heart, we were not at home, when it happened! We lost around 6000USDs of property, my camera gear, belongings, and so on. The Police told us that this is normal, and it is unlikely, that they will catch them, and it never happened. I had to stop pursuing my dream to become a professional photographer 😭! I kept shooting with my Galaxy Note 2, Samsung had really great cameras, and it seems that they still do these days 😝! David my good friend from High School, was the one, who had introduced video making to me, and I started to learn on my own editing videos in Premiere Pro (yeah, this was before my MAC 😝!)\n\n",
    "PHOTOGRAPHY_P3": "Eventually, I've saved up money again, and bought the Canon 600d with \"Nifty, Fifty\" again 😝! Now, I even had some knowledge about making videos, so I started making editing my own clips. During college, I enrolled the course about \"Visual Communications\" taught on University of Economics, Prague by professor Horny, it was great experience, and I got so hooked! There were not opportunities for me as Wedding photographer anymore, and even if there would be, I had no proper gear anymore (as flashes, soft-boxes, stands and so on). My loyalty with Canon did not last long, because in February 2015, I decided to jump ship, I sold all my Canon gear, which was only the Canon 600D and the 50-mm F1.8, and I bought the Sony A6000, which was amazing camera. You can find more about my review in the BLOG page.\n\n",
    "PHOTOGRAPHY_P4": "I completely stop improving my skills in PHOTOGRAPHY and MOVIE creation, because during 2015, my Dad was already really weak, he had to visit the doctor regularly. When he was not able to walk anymore, me and my mom visited him regularly. He had taken Chemotherapy only once, later doses had no effect anymore, so eventually he moved to Special Care Section, where he basically stayed until he passed away.\n\n",
    "PHOTOGRAPHY_P5": "Today, I still love PHOTOGRAPHY, besides PORTRAITURE, I started to really like TRAVEL PHOTOGRAPHY, and I started to heavily focus on this category. I am inspired by the famous photographer Elia Locardi. Besides, taking pictures, I started to make VLOGS as well, usually about TRAVEL. I was inspired by the famous Casei Neistat.",
    "PHOTOGRAPHY_P6": "I don't know if I can ever shoot a wedding, but I keep shooting 😝!",
    "TRAVEL_AND_CUISINE_H2": "Travel and Cuisine\n",
    "TRAVEL_AND_CUISINE_P": "When my Dad passed away in 2016, I spent all my saving to for travelling. Interesting fact is that, I've never travelled so much before, in fact it was not something that would make me happy, so I was not even paying attention about it. I would rather spent the money for some Tech or Video Game, but when my Dad passed away, I just wanted to travel to forget about the fact, that he was not with us anymore. I started to travel at first with few friends, and eventually I mastered the SOLO travelling, and started to travel by myself.\n\n",
    "TRAVEL_AND_CUISINE_H3": "I've managed to visit these countries:\n\n",
    "TRAVEL_AND_CUISINE_P2": "What about the Cuisine in the heading you may ask? Well, I was always passionate about the food that my Mom and Dad cooked, but when I started to travel, that was really the moment, when I really found the passion in enjoying food around the World. Besides, a man gotta eat, right?\n\n",
    "WEB_DEVELOPMENT_H2": "Web Development\n",
    "WEB_DEVELOPMENT_P1": "My passion about the Web started already in 1995, when my friend for the first time showed me the SEZNAM search engine. Like everybody else, I was hooked in using the web, especially for finding information, chatting, playing games and listening to music. Basically, I was using it as everybody else, but never ever have I thought, that someday I would be creating the apps on the WEB.\n\n",
    "WEB_DEVELOPMENT_P2": "It's kind a shame, that I got into this topic really late. Especially, when I had my first computer quite early. I think it is connected with the fact, that both of my parents are non-technical, and when I finished elementary school, I basically had no idea, what I would be doing in the future, so I enrolled for Business Academy. During my four years of high school, there were IT courses, but most of them were only teaching how to work with Microsoft Office. Well, what can you expect from BIZ school right?\n\n",
    "WEB_DEVELOPMENT_P3": "After high school, I still did not have any clue, what I would be doing, and since my parents did not either, we asked around, and the only option for me would be University of Economics, or University of Life Science (wtf, right, well it's a new name, it used to be Agriculture University). Interesting fact, I sucked at math, so I had to learn really hard to pass the entering exams.\n\n",
    "WEB_DEVELOPMENT_P4": "There were few faculties I could choose to enroll the studies:\n\n",
    "WEB_DEVELOPMENT_LI1": "Faculty of International Relations (was hottest during my time)\n",
    "WEB_DEVELOPMENT_LI2": "Faculty of Financial Studies (would be most appropriate for me coming from BIZ Academy)\n",
    "WEB_DEVELOPMENT_LI3": "Faculty of Informatics and Statistics (I ended here :-))\n",
    "WEB_DEVELOPMENT_P5": "Frankly, I was aiming for the first two, because it would be logical choice. At least, I thought so, naively 😝! The thing is that I failed the entrance exam, and I had to do the exams again during summer 2007. I've always liked the IT, with my background it would be natural choice, but again since I was spending four years learning BIZ and Economics, I thought it would be waste of my time.\n\n",
    "WEB_DEVELOPMENT_P6": "Luckily, I think it was my destiny, that I failed the other two faculties, because of that, I had to attend the FIT.\n\n",
    "WEB_DEVELOPMENT_P7": "I've spent 7 years finishing the MSc on my faculty, it was long 7 years, but I will always remember those moments. I learned so much during those 7 years, the funny thing, is that I learned more about life itself than about what I would do professionally. So the thing about University of Economics is that, on the Bachelor's programme all students, no matter which Faculty they belong to, has shared courses, like:\n\n",
    "WEB_DEVELOPMENT_LI4": "Economics",
    "WEB_DEVELOPMENT_LI5": "Statistics",
    "WEB_DEVELOPMENT_LI6": "Math",
    "WEB_DEVELOPMENT_LI7": "Accounting",
    "WEB_DEVELOPMENT_LI8": "International Economics\n",
    "WEB_DEVELOPMENT_LI9": "and so on\n",
    "WEB_DEVELOPMENT_P8": "All the mentioned courses were great, tough but great, but there were others that were really boring, and you just had to pass them.My first contact with programming was in the first semester, when our teachers introduced us to JAVA, which supposed to be multi-purpose language. Like JavaScript these days, and it kinda was and still is, but the thing is that the lectures were so boring, and really tough for a guy like me coming from BIZ academy to understand. It was not their faults, it was the style, and the way they taught, I did not see any potential in learning the language. I just managed to pass the exams, and did not care about it.",
    "WEB_DEVELOPMENT_LI10": "Head First HTML with CSS & XHTML (Book by Elisabeth Freeman and Eric Freeman)\n",
    "WEB_DEVELOPMENT_P9": "Honestly, I never thought I would become a Web Developer due to my history with the topic. It was hard, boring, and the time I had spent to learn something was not worth it. After BC programme I did not manage to pass the entering exams to the Master's, so I had to wait 6 months until next opportunity. During this time I had a chance to read and learn about Web Development from this book:",
    "WEB_DEVELOPMENT_P10": "A great book indeed, it was the lecture that I was waiting for, full of motivation, fun and interesting way how to teach, and it basically got me hooked. For newbies, I totally recommend this book! During my Master's programme, I had a chance to enroll to Web Development course, so thanks to my experience from the book, I was not lost anymore. Here I got a chance to build my personal site with CSS, HTML and PHP. Sadly, no JavaScript was teach here. I liked the course, it gave me a lot. After University, I landed a job as Junior Front-End developer. Then to another job, where I learned about ReactJS, and you can read the rest on my LinkedIn Profile.",
    "PURPOSE_OF_THIS_BLOG_H1": "Purpose of this blog\n",
    "PURPOSE_OF_THIS_BLOG_P1": "When I established this blog, I wanted share my knowledge about all the topics I've learnt as self-taught guy during all those years. I wanted to let people like me know about the challenges and results that they can achieve and help to motivate them, as all my inspired teachers had motivated me.\n\n",
    "PURPOSE_OF_THIS_BLOG_P2": "Even tough nowadays, thanks to the Internet, every body can learn anything they want! There are still segment of people, who do not know English and cannot learn from English speaking/written sources. Funny, right? My blog is in English as well, well I want to localise my blog in future as well. At first, I want to help teach and share my knowledge to my fellow Vietnamese community living here in Prague. Most of Vietnamese people living here, still do not speak and read English, so I would want to help them learn more about tech topics and jobs available today. Prepare them for the future, where programming and tech skills will be needed!\n\n\n"
  }
}