{
  "ABOUT": {
    "HERO_TITLE": "VỀ MÌNH",
    "INTRO_H1": "Giới thiệu",
    "INTRO_P": "Xin chào quý khách, tôi tên là Hải Hà (bạn bè gọi tôi là Haiko, do đó tên của trang này), tôi gốc Việt Nam 🇻🇳, đất nước mà nhiều người biết qua các bộ phim Mỹ, thường gắn liền với Chiến tranh ⚔️, nhưng ngày nay thì là một trong những quốc gia thú vị nhất để đến thăm ở Đông Nam Á, nhờ vùng nông thôn xinh đẹp và đồ ăn ngon. Vâng, món súp \"PHO\" 🍜 nổi tiếng! Trên thực tế, nó rất đẹp, nhiều bộ phim, đã được quay ở đây. Tên phim mới nhất là \"Kong: Skull Island\", nên nếu bạn chưa xem thì hãy xem qua, phim khá hay, thêm vào đó bạn sẽ thấy cảnh quan tuyệt đẹp!",
    "MY_STORY_H1": "Câu chuyện của tôi",
    "MY_STORY_P": "Năm đó là 1987, và tôi sinh ra ở Việt Nam. Tôi sống ở đó cho đến khi lên năm tuổi, vì vậy vào năm 1993, tôi chuyển đến Cộng hòa Séc cùng với bố mẹ. Chúng tôi đã sống ở thủ đô Praha kể từ đó. Bạn có thể hỏi tại sao lại là Prague? À, truyện dài ngắn, bố mẹ tôi yêu nhau ở thành phố, khi họ chuyển về Việt Nam năm 1986, cuộc sống ở đó vẫn còn thiếu thốn (về kinh tế) so với Séc. Ở đây, tôi muốn chỉ ra rằng, có rất nhiều bạn bè cùng trang lứa của tôi với câu chuyện tương tự. Lý do đằng sau điều này, là thỏa thuận hợp tác giữa Việt Nam và Cộng hòa Séc vào những năm 1950.",
    "MY_STORY_P2": "Vì vậy, khi tôi đủ lớn, bố tôi quyết định rằng chúng tôi nên quay trở lại Praha. Tôi nhớ ngày đầu tiên tôi đến Praha, đó là vào mùa đông năm 1993 (tháng 1 hoặc tháng 2), đó là lần đầu tiên tôi nhìn thấy tuyết ❄️, và nó rất lạnh, nhưng tôi thích nó, và sẽ không bao giờ quên chốc lát. Khi còn nhỏ, tôi lớn lên học tiếng Séc, đó là một quá trình tự nhiên đối với tôi, những đứa trẻ học nhanh hơn nhiều, bạn biết đấy 😀. Tôi được giáo dục như bao đứa trẻ Séc khác, và nhờ sự hỗ trợ của cha mẹ, tôi đã vượt qua tất cả các loại hình chính của hệ thống giáo dục Séc. Ở trường và trong cuộc sống hàng ngày, tôi có cơ hội tìm hiểu về văn hóa, lịch sử và thói quen của người dân Séc. Bên cạnh đó, ở nhà, tôi được học văn hóa, lịch sử, thói quen của người Việt, cộng với việc bố mẹ tôi nói tiếng Việt ở nhà nên đây là điều tuyệt vời đối với tôi, vì tôi được học cả hai ngôn ngữ một cách tự nhiên.",
    "MY_STORY_P3": "Tôi quên nói thêm rằng năm 1995, bố mẹ tôi mời b Năm (anh trai của mẹ tôi) từ Việt Nam sang, ở với chúng tôi đến năm 1998 thì ông phải chuyển về Hà Nội vì chuyện gia đình. Kế hoạch ban đầu là kiếm đủ tiền, cuối cùng chúng tôi sẽ mời dì Cham và các anh chị em họ của tôi nữa, nhưng đôi khi dù bạn cố gắng đến mấy thì kế hoạch vẫn không thành công.",
    "MY_STORY_P4": "Bạn biết đấy, khi họ nói cuộc sống có \"thăng trầm\", cho đến Giáng sinh năm 2014. Đối với tôi, đó thường là những thăng trầm, đôi khi tôi làm sai điều gì đó hoặc công việc kinh doanh của bố mẹ không suôn sẻ (và vâng, công việc của Người Việt Nam từ những năm 1950 đến những năm 2010 nhìn chung rất tệ, thường thì chúng tôi sẽ kinh doanh như bán quần áo giá rẻ để thay thế cho người Séc vì họ không đủ khả năng chi trả cho quần áo hàng hiệu, hoặc chúng tôi sẽ làm công việc lao động giá rẻ trong các nhà máy, đó là lý do chính tại sao người Việt Nam thực sự đến Séc vào những năm 50, nhưng sẽ nói thêm về chủ đề này trong một bài viết khác). Quay trở lại vấn đề, không có thất bại nào của chúng ta, sẽ liên quan đến sức khỏe, đó thực sự là điều quý giá nhất mà mỗi chúng ta có ngày nay. Nếu chúng ta khỏe mạnh, chúng ta có thể làm bất cứ điều gì chúng ta muốn, miễn là tuổi thọ của chúng ta có thể mang lại. Vì vậy, mọi chuyện bắt đầu với những cơn ho đơn giản của bố tôi, và cuối cùng ông ấy được chẩn đoán mắc bệnh ung thư phổi, lúc đầu ông ấy cố giấu tôi và mẹ, nhưng cuối cùng ông ấy đã nói với tôi. Thành thật mà nói, tôi đã bắt đầu lên google tìm kiếm mọi thứ về các triệu chứng của anh ấy, và điều này mới xảy ra, nhưng nó vẫn là một cú sốc đối với tôi, khi bố tôi nói với tôi sự thật và lý do anh ấy cố gắng tránh xa nó. Tôi và mẹ. Anh ấy nói với tôi rằng, anh ấy sợ, mẹ tôi sẽ chịu đựng được sự thật, và anh ấy nghĩ, mẹ sẽ suy sụp. Vì vậy, anh ấy muốn, rằng tôi sẽ giữ bí mật với mẹ tôi càng lâu càng tốt. Về cơ bản, anh ấy đã chuẩn bị cho điều tồi tệ nhất, khiến tôi mạnh mẽ hơn về mặt cảm xúc, và anh ấy đã thành công, bởi vì bây giờ tôi không khóc chút nào, điều này rất quan trọng khi cuối cùng tôi nói với mẹ vào tháng 12 năm 2015, chỉ ba tháng kể từ ngày bố tôi. đã qua đời. Khi tôi nói với mẹ sự thật, cô ấy thực sự rất buồn, nhưng cô ấy biết toàn bộ thời gian, cô ấy nói với tôi rằng cô ấy tò mò và kiểm tra trên mạng về các triệu chứng của bố tôi, và cũng hỏi bạn bè của cô ấy, một số là bác sĩ. Cô ấy đã thực sự can đảm và tôi hiếm khi thấy cô ấy khóc trong vài tháng qua. Bố tôi qua đời vào ngày 3 tháng 3 năm 2016, ông đã dũng cảm chiến đấu với bệnh tật trong hai năm. Đó là khoảng thời gian hai năm buồn nhất trong cuộc đời tôi, nhưng nó cũng giúp tôi mở mắt và cho tôi biết, điều gì là thực sự quan trọng đối với tôi trong cuộc đời, và tôi nghĩ rằng kể từ giây phút đó, tôi đã thực sự trở thành một người đàn ông trưởng thành.",
    "WHAT_I_LIKE_H1": "Điều m thích",
    "WHAT_I_LIKE_P": "Có khá nhiều thứ tôi thích, nhưng chắc chắn những thứ này sẽ nằm trong danh sách của tôi:",
    "GAMES_AND_COMPUTERS_H2": "Games và Máy Tính",
    "GAMES_AND_COMPUTERS_P": "Lớn lên ở Cộng hòa Séc, tôi may mắn được tiếp xúc với Công nghệ khi còn nhỏ. Công nghệ đầu tiên của tôi chắc chắn là bản sao của hệ thống 🎮NES từ Nintendo, mà bố tôi đã mua vào sinh nhật lần thứ 7 của tôi. Hệ thống này là cách tôi được giới thiệu với Trò chơi điện tử, tôi đã dành vô số giờ cho các trò chơi như Super Mario Bros, Tetris, Contra, Tanks và tất cả các tác phẩm kinh điển của hệ thống có sẵn trên thị trường Séc. Tôi cũng đã được giới thiệu với Windows 95 và sau đó là 98, nhờ bạn bè của tôi. Không phải đứa trẻ như chúng tôi có cơ hội làm việc với máy tính, nhưng bố mẹ chúng thường dựa vào chúng và chúng tôi chỉ tình cờ lén lút chơi game trên máy tính. 1995 là năm tôi được giới thiệu với Internet và World Wide Web. Trang đầu tiên mà bạn tôi cho tôi xem là www.seznam.cz, dù tin hay không thì nó vẫn tồn tại cho đến ngày nay ở Cộng hòa Séc. Nếu bạn không biết, nó là phiên bản tiếng Séc của trí tưởng tượng \"Google\", vì vậy về cơ bản là một công cụ tìm kiếm toàn văn bản. Chúa ơi, nó làm tôi nhớ đến thời kỳ cũ của kết nối điện thoại có dây chậm, tốc độ cao nhất là 5kb / s 😱! Tôi và bạn bè của tôi, chúng tôi đã thành thạo tất cả các trò chơi nổi tiếng trong thời đại này như Prince of Persia, Doom, Duke Nukem 3D, Mortal Kombat, v.v. Năm 1996 cũng là năm tôi lần đầu tiên nhìn thấy chiếc Sony Playstation One nổi tiếng trong cửa hàng cùng với bố, người đàn ông mà tôi không bao giờ quên được cảm giác được xem và chơi những trò chơi tiên tiến như vậy, tôi rất muốn, nhưng chúng tôi không có đủ tiền, bảng điều khiển thực sự đắt (500 USD, tôi nghĩ ngày nay nó sẽ có giá 700 USD do lạm phát hoặc hơn). Bố tôi hứa rằng trong vòng hai năm, ông sẽ mua nó cho tôi, và ông đã làm. Tôi nhận được của tôi vào tháng 10 năm 1998 như một món quà sinh nhật. Hãy tin tôi, Playstation Nation vẫn còn chảy trong tôi cho đến thời điểm này! Khi còn nhỏ, điều duy nhất tôi muốn làm sau giờ học là đến nhà bạn bè và chơi trò chơi của họ 😀, bởi vì chúng tôi không có PC trong nhà. Ít nhất là phải đến năm 2001, khi tôi nhận được chiếc đầu tiên làm quà sinh nhật 😍! Bây giờ, cuối cùng tôi đã không phải mất hàng giờ để chơi ở nhà bạn của tôi, thay vào đó họ sẽ đến chỗ của tôi, bởi vì đột nhiên tôi có trong tay cái mới nhất và tuyệt vời nhất 😎! Nhờ trải nghiệm tại nhà bạn bè, tôi đã biết cách sử dụng Windows, phiên bản của tôi là Millennium Edition, lúc đầu tôi nghĩ nó rất tuyệt, cho đến khi tôi cài đặt XP 🙈!",
    "GAMES_AND_COMPUTERS_P2": "Trong thời gian học đại học, tôi được một số bạn cùng lớp giới thiệu về máy Mac 👨🏻‍💻và iPhone📱 đã tìm cách mang những món đồ chơi này từ Mỹ về. Đúng, đó là năm 2007, khi Steve Jobs giới thiệu iPhone đời đầu. Vấn đề là, cho đến thời điểm này, Apple không quá phổ biến ở Cộng hòa Séc, và tất cả bạn bè của tôi thường có điện thoại thông minh chạy Windows và Windows hoặc thậm chí là Symbian của Nokia, vâng vào những ngày đó. Vì vậy, tôi cũng nghĩ rằng Windows và PC vẫn vượt trội hơn MAC, ngoài ra Windows hỗ trợ nhiều trò chơi hơn! IPhone lại là một câu chuyện khác, cho đến thời điểm này, tôi nhớ là tôi rất thích nó, nhưng điều duy nhất khiến tôi tránh xa là giá cả, và vì tôi chưa biết gì về triết lý của Apple, tôi nghĩ. ngây thơ rằng nó về cơ bản đã được định giá quá cao. Dù thế nào đi nữa, tôi đã làm công việc phụ để tiết kiệm tiền mua chiếc iPhone đầu tiên của mình, nhưng khi có tiền, tôi quyết định sau tất cả các đánh giá và nhận thức chung để bỏ tiền vào: đoán xem ?, một chiếc Windows Phone, chiếc điện thoại nổi tiếng HTC Diamond 2. Điều tương tự cũng xảy ra khi tôi được giới thiệu iPad 2, tôi biết mình rất muốn có nó, nhưng cuối cùng, tôi đã mua Galaxy Tab để thay thế, vâng OMG! Nói ngắn gọn, trong một thời gian dài tôi đã tin rằng Apple bị định giá quá cao và tôi nên đầu tư tiền của mình vào các lựa chọn thay thế, thứ sẽ mang lại cho tôi hiệu suất tương tự với mức giá thấp hơn, mặc dù tôi thích sản phẩm. Tốt nhất bạn nên làm như họ nói, và đó là lý do tại sao tôi ở lại hệ sinh thái Apple lâu như vậy. Tôi ít biết rằng đôi khi trong Công nghệ, chất lượng hiệu suất. Điều nào giống nhau đối với Windows và Mac hoặc Android với iOS.",
    "GAMES_AND_COMPUTERS_P3": "Cho đến năm 2013, khi thực sự có một mức giá tốt cho iPad Mini 2, tôi thực sự muốn thay thế chiếc Nexus 7 cũ của mình. Cuối cùng thì tôi cũng mua nó và điều này cuối cùng đã thay đổi suy nghĩ của tôi về các sản phẩm của Apple. IOS thực sự rất mượt mà, có những ứng dụng thực sự quan trọng đối với tôi và những ứng dụng này thậm chí không có trên Android. Mọi thứ chỉ hoạt động và tôi không phải mất vô số giờ để học cách ROOT điện thoại và làm cho nó hoạt động như tôi muốn.",
    "GAMES_AND_COMPUTERS_P4": "Một cột mốc quan trọng khác đối với tôi là vào mùa thu năm 2013, khi tôi giúp người bạn của mình mua MacBook Pro 2013 Late Edition, tôi đã có cơ hội giúp anh ấy thiết lập nó và bằng cách nào đó tôi thực sự muốn nó. Máy tính để bàn cũ của tôi thực sự rất chậm và tôi muốn có một chiếc máy mới. Vào ngày sinh nhật của mình, tôi đã tiết kiệm hết tiền và mua chiếc MacBook Pro 15 \"đầu tiên với thông số kỹ thuật hàng đầu. Vài ngày đầu, tôi thậm chí còn nghĩ rằng mình đã mắc phải sai lầm tồi tệ nhất trong đời khi tiêu quá nhiều tiền vào máy tính xách tay 🙈! Trong khi , Tôi có thể chi ít hơn hoặc với mức giá tương đương để mua một chiếc máy tính để bàn PC có thông số kỹ thuật hàng đầu. Tôi rất vui vì tôi đã đưa ra quyết định đó, bởi vì chiếc máy hoạt động như một viên ngọc quý! Tôi vừa mới bán nó với giá mà bạn sẽ không bao giờ có được đối với máy tính xách tay PC. Đó là một điều khác về các sản phẩm của Apple, chúng giữ giá trị rất lâu! Sau máy Mac, tôi hoàn toàn bị thu hút và tất cả các sản phẩm còn lại của Apple sẽ theo sau 🙈! Tôi đã đọc tất cả những điều đó là về lịch sử và triết lý của Apple, và tôi phát hiện ra rằng tôi cũng có cách suy nghĩ tương tự và tôi thực sự thích thương hiệu! Tôi đã trở thành \"iSheep\" 🙈 theo đúng nghĩa đen!",
    "GAMES_AND_COMPUTERS_P5": "Như bạn có thể thấy, tôi rất lấy cảm hứng từ các trò chơi điện tử và đó là một trong những sở thích của tôi, mà tôi thực sự thích, cho đến thời điểm này. Thật không may, ngày nay tôi không có nhiều thời gian, nhưng khi có, tôi thực sự có thể thích chơi những bản hit mới nhất! Đối với máy tính, tôi thực sự biết ơn những gì Steve Jobs và Apple đã làm cho thế giới công nghệ và nhân loại!",
    "PHOTOGRAPHY_H2": "Nhiếp ảnh",
    "PHOTOGRAPHY_P": "Luôn có điều gì đó về Nhiếp ảnh mà tôi thích. Cho dù đó là thẩm mỹ hay chính cách kể chuyện. Tôi bắt đầu cuộc hành trình của mình vào năm 2003 khi lần đầu tiên tôi mua chiếc máy ảnh kỹ thuật số có bộ nhớ 128-MB, nó là một thương hiệu rẻ tiền, nhưng đủ cho mục đích của tôi và tôi đã tiêu hết số tiền mình có để mua nó. Nó chỉ có cảm biến 3.2MPX, với một số ống kính rẻ tiền được gắn trên đó. Nó có một số tính năng bán thủ công, nhưng tôi hoàn toàn không biết, về cơ bản là một điểm & chụp để tôi bắt đầu. Như bất kỳ Joe bình thường nào, tôi không biết về các thuật ngữ như SHUTTER, APERTURE, ISO, EXPOSURE, v.v. Hình ảnh của tôi thật khủng khiếp, nhưng tôi chỉ thích chúng!",
    "PHOTOGRAPHY_P2": "Năm 2010, trong những ngày học đại học, nhờ có Internet và Lynda.com, tôi bắt đầu học chuyên nghiệp hơn về CHỤP ẢNH, và tôi thực sự bị cuốn hút. Tôi quyết định tiết kiệm tất cả tiền của mình từ công việc bán thời gian mà tôi đang làm và vào ngày sinh nhật của mình, tôi và bố tôi đã mua chiếc D-SLR đầu tiên của tôi từ Canon, chiếc Canon 50D khét tiếng, với chiếc \"Plastic, Fantastic\" 50- ống kính mm F1.8. Đây là một sự kết hợp tuyệt vời, và những bức ảnh của tôi dần trở nên đẹp hơn, tôi tập trung hơn vào việc chụp chân dung, và tôi thậm chí muốn trở thành một nhiếp ảnh gia chuyên nghiệp và bắt đầu chụp đám cưới để kiếm sống. Giấc mơ này đã bị lãng phí khi căn hộ của chúng tôi bị cướp giữa ban ngày. Chúng tôi đang sống ở một trong những khu phố tồi tệ nhất ở Praha kể từ năm 1995, và những điều này là bình thường, chúng tôi đã nghe về nó trên tin tức và TV, nhưng đừng bao giờ tưởng tượng rằng điều này sẽ xảy ra với chúng tôi. May mắn thay không ai trong chúng tôi có trái tim, chúng tôi không có ở nhà, khi nó xảy ra! Chúng tôi đã mất khoảng 6000 USD tài sản, thiết bị máy ảnh, đồ đạc của tôi, v.v. Cảnh sát nói với chúng tôi rằng điều này là bình thường, và không có khả năng họ sẽ bắt được họ, và điều đó chưa bao giờ xảy ra. Tôi đã phải ngừng theo đuổi ước mơ trở thành một nhiếp ảnh gia chuyên nghiệp 😭! Tôi tiếp tục chụp bằng Galaxy Note 2 của mình, Samsung có những chiếc máy ảnh thực sự tuyệt vời, và có vẻ như họ vẫn làm như vậy ngày nay 😝! David, người bạn tốt của tôi thời trung học, là người đã giới thiệu cách làm video cho tôi, và tôi bắt đầu tự học cách chỉnh sửa video của mình trong Premiere Pro (vâng, đây là trước MAC của tôi 😝!)",
    "PHOTOGRAPHY_P3": "Cuối cùng, tôi lại tiết kiệm được tiền và mua lại chiếc Canon 600d với \"Nifty, Fifty\" 😝! Bây giờ, tôi thậm chí đã có một số kiến thức về làm video, vì vậy tôi bắt đầu tự biên tập các clip của mình. Trong thời gian học đại học, tôi đã đăng ký khóa học về \"Truyền thông thị giác\" do giáo sư Horny giảng dạy tại Đại học Kinh tế, Praha, đó là một trải nghiệm tuyệt vời, và tôi đã rất hứng thú! Không còn cơ hội nào cho tôi với tư cách là nhiếp ảnh gia Đám cưới nữa, và ngay cả khi có, tôi cũng không còn thiết bị phù hợp nữa (như đèn flash, hộp mềm, chân đế, v.v.). Lòng trung thành của tôi với Canon không kéo dài lâu, bởi vì vào tháng 2 năm 2015, tôi quyết định chuyển tàu, tôi đã bán tất cả thiết bị Canon của mình, chỉ là Canon 600D và 50-mm F1.8, và tôi mua Sony A6000, là máy ảnh tuyệt vời. Bạn có thể tìm thêm về đánh giá của tôi trong trang BLOG.",
    "PHOTOGRAPHY_P4": "Tôi hoàn toàn ngừng nâng cao kỹ năng CHỤP ẢNH và LÀM PHIM, bởi vì trong năm 2015, bố tôi đã rất yếu, phải đi khám bác sĩ thường xuyên. Khi cháu không đi được nữa, tôi và mẹ đến thăm cháu thường xuyên. Anh ta chỉ dùng Hóa trị một lần, những liều sau đó không còn tác dụng nữa, nên cuối cùng anh ta chuyển đến Khoa Chăm sóc Đặc biệt, nơi về cơ bản anh ta ở lại cho đến khi qua đời.",
    "PHOTOGRAPHY_P6": "Không biết bao giờ mới chụp được ảnh cưới nhưng cứ chụp shooting!\n",
    "TRAVEL_AND_CUISINE_H2": "Du lịch và Ẩm thực",
    "TRAVEL_AND_CUISINE_P": "Khi bố tôi qua đời vào năm 2016, tôi đã dành toàn bộ số tiền tiết kiệm được để đi du lịch. Sự thật thú vị là, tôi chưa bao giờ đi du lịch nhiều như vậy trước đây, thực tế đó không phải là điều khiến tôi hạnh phúc, vì vậy tôi thậm chí không chú ý đến nó. Tôi thà dành tiền cho một số Công nghệ hoặc Trò chơi điện tử, nhưng khi bố tôi qua đời, tôi chỉ muốn đi du lịch để quên đi sự thật rằng ông không còn ở bên chúng tôi nữa. Lúc đầu, tôi bắt đầu đi du lịch với một vài người bạn, và cuối cùng tôi đã thành thạo SOLO đi du lịch, và bắt đầu đi du lịch một mình.",
    "TRAVEL_AND_CUISINE_H3": "Tôi đã cố gắng đến thăm các quốc gia này:\n",
    "TRAVEL_AND_CUISINE_P2": "Điều gì về Ẩm thực trong tiêu đề bạn có thể hỏi? Chà, tôi luôn say mê những món ăn mà bố mẹ tôi nấu, nhưng khi tôi bắt đầu đi du lịch, đó mới thực sự là thời điểm tôi thực sự tìm thấy niềm đam mê thưởng thức ẩm thực trên khắp thế giới. Hơn nữa, một người đàn ông phải ăn, phải không?",
    "WEB_DEVELOPMENT_H2": "Lập Trình Web",
    "WEB_DEVELOPMENT_P1": "Niềm đam mê của tôi về Web bắt đầu từ năm 1995, khi người bạn của tôi lần đầu tiên cho tôi xem công cụ tìm kiếm SEZNAM. Giống như những người khác, tôi rất thích sử dụng web, đặc biệt là để tìm kiếm thông tin, trò chuyện, chơi trò chơi và nghe nhạc. Về cơ bản, tôi đang sử dụng nó như mọi người, nhưng tôi chưa bao giờ nghĩ rằng một ngày nào đó tôi sẽ tạo ra các ứng dụng trên WEB.",
    "WEB_DEVELOPMENT_P2": "Thật tiếc, tôi đã tham gia vào chủ đề này rất muộn. Đặc biệt, khi tôi có chiếc máy tính đầu tiên khá sớm. Tôi nghĩ rằng nó liên quan đến thực tế, cả bố và mẹ tôi đều không phải là kỹ thuật, và khi tôi học xong tiểu học, về cơ bản tôi không biết mình sẽ làm gì trong tương lai, vì vậy tôi đã đăng ký vào Học viện Kinh doanh. Trong suốt bốn năm trung học của tôi, có các khóa học về CNTT, nhưng hầu hết chúng chỉ dạy cách làm việc với Microsoft Office. Chà, bạn có thể mong đợi gì ở trường BIZ đúng không?",
    "WEB_DEVELOPMENT_P3": "Sau khi tốt nghiệp trung học, tôi vẫn không biết mình sẽ làm gì, và vì bố mẹ tôi cũng vậy, chúng tôi đã hỏi thăm xung quanh và lựa chọn duy nhất cho tôi là Đại học Kinh tế hoặc Đại học Khoa học Đời sống (wtf, Đúng, đó là một cái tên mới, nó từng là Đại học Nông nghiệp). Sự thật thú vị, tôi mê môn toán, vì vậy tôi phải học rất chăm chỉ để vượt qua kỳ thi đầu vào.",
    "WEB_DEVELOPMENT_P4": "Có một số khoa tôi có thể chọn để đăng ký nghiên cứu:",
    "WEB_DEVELOPMENT_LI1": "Khoa Quan hệ Quốc tế (nóng nhất trong thời gian của tôi)",
    "WEB_DEVELOPMENT_LI2": "Khoa Nghiên cứu Tài chính (sẽ là thích hợp nhất đối với tôi đến từ Học viện BIZ)",
    "WEB_DEVELOPMENT_LI3": "Khoa Tin học và Thống kê (Tôi  đây :-))",
    "WEB_DEVELOPMENT_P5": "Thành thật mà nói, tôi đã nhắm đến hai điều đầu tiên, bởi vì đó sẽ là lựa chọn hợp lý. Ít nhất, tôi đã nghĩ vậy, ngây thơ 😝! Vấn đề là tôi đã trượt kỳ thi đầu vào, và tôi đã phải thi lại trong mùa hè năm 2007. Tôi luôn thích CNTT, với nền tảng của tôi thì đó là lựa chọn tự nhiên, nhưng một lần nữa vì tôi đã dành bốn năm học BIZ và Kinh tế, tôi nghĩ nó sẽ lãng phí thời gian của tôi.",
    "WEB_DEVELOPMENT_P6": "May mắn thay, tôi nghĩ đó là số phận của tôi, tôi đã thi trượt hai khoa còn lại, vì thế mà tôi phải tham dự FIT.",
    "WEB_DEVELOPMENT_P7": "Tôi đã dành 7 năm để hoàn thành chương trình Thạc sĩ tại khoa của mình, đó là 7 năm dài, nhưng tôi sẽ luôn ghi nhớ những khoảnh khắc đó. Tôi đã học được rất nhiều điều trong suốt 7 năm đó, điều buồn cười là tôi đã học được nhiều điều về cuộc sống hơn là về những gì tôi sẽ làm một cách chuyên nghiệp. Điều đáng nói ở Đại học Kinh tế là, trong chương trình Cử nhân, tất cả sinh viên, dù thuộc Khoa nào, đều có các khóa học chung, như:",
    "WEB_DEVELOPMENT_LI4": "Kinh tế học",
    "WEB_DEVELOPMENT_LI5": "Thống kê",
    "WEB_DEVELOPMENT_LI6": "Toán",
    "WEB_DEVELOPMENT_LI7": "Kế toán",
    "WEB_DEVELOPMENT_LI8": "Kinh tế quốc tế\n",
    "WEB_DEVELOPMENT_LI9": "vân vân\n",
    "WEB_DEVELOPMENT_P8": "Tất cả các khóa học được đề cập đều tuyệt vời, khó khăn nhưng tuyệt vời, nhưng có những khóa học khác thực sự nhàm chán, và bạn chỉ cần vượt qua chúng.",
    "WEB_DEVELOPMENT_LI10": "Head First HTML with CSS & XHTML (Book by Elisabeth Freeman and Eric Freeman)\n",
    "WEB_DEVELOPMENT_P9": "Thành thật mà nói, tôi chưa bao giờ nghĩ mình sẽ trở thành một Nhà phát triển web do lịch sử của tôi với chủ đề này. Thật khó, thật nhàm chán và thời gian tôi đã bỏ ra để học một thứ không đáng là bao. Sau chương trình BC, tôi đã không thể vượt qua kỳ thi đầu vào lên Thạc sĩ, vì vậy tôi phải đợi 6 tháng cho đến khi có cơ hội tiếp theo. Trong thời gian này, tôi đã có cơ hội đọc và tìm hiểu về Phát triển Web từ cuốn sách này:",
    "WEB_DEVELOPMENT_P10": "Thực sự là một cuốn sách tuyệt vời, đó là bài giảng mà tôi đang chờ đợi, tràn đầy động lực, cách dạy vui nhộn và thú vị, và về cơ bản nó đã khiến tôi bị cuốn hút. Đối với người mới, tôi hoàn toàn giới thiệu cuốn sách này! Trong thời gian học Thạc sĩ, tôi có cơ hội đăng ký tham gia khóa học Phát triển web, nên nhờ kinh nghiệm từ cuốn sách mà tôi không bị lạc lõng nữa. Tại đây, tôi có cơ hội xây dựng trang web cá nhân của mình bằng CSS, HTML và PHP. Đáng buồn thay, không có JavaScript nào được dạy ở đây. Tôi thích khóa học, nó đã cho tôi rất nhiều. Sau khi tốt nghiệp Đại học, tôi đã nhận được một công việc là nhà phát triển Junior Front-End. Sau đó đến một công việc khác, nơi tôi đã học về ReactJS và bạn có thể đọc phần còn lại trên Hồ sơ LinkedIn của tôi.",
    "PURPOSE_OF_THIS_BLOG_H1": "Mục đích của blog này\n",
    "PURPOSE_OF_THIS_BLOG_P1": "Khi tôi thành lập blog này, tôi muốn chia sẻ kiến thức của mình về tất cả các chủ đề mà tôi đã học được khi tự học trong suốt những năm đó. Tôi muốn cho những người như tôi biết về những thách thức và kết quả mà họ có thể đạt được và giúp tạo động lực cho họ, vì tất cả các giáo viên truyền cảm hứng của tôi đã thúc đẩy tôi.",
    "PURPOSE_OF_THIS_BLOG_P2": "Ngày nay dù khó khăn đến mấy, nhờ có Internet, mọi cơ thể đều có thể học bất cứ thứ gì họ muốn! Vẫn còn một số bộ phận người dân không biết tiếng Anh và không thể học từ các nguồn nói / viết tiếng Anh. Buồn cười, phải không? Blog của tôi cũng bằng tiếng Anh, tôi cũng muốn bản địa hóa blog của mình trong tương lai. Lúc đầu, tôi muốn giúp đỡ việc giảng dạy và chia sẻ kiến thức của mình cho những người Việt Nam đang sinh sống tại Praha. Hầu hết người Việt Nam sống ở đây vẫn chưa nói và đọc được tiếng Anh, vì vậy tôi muốn giúp họ tìm hiểu thêm về các chủ đề công nghệ và việc làm hiện nay. Chuẩn bị cho họ cho tương lai, nơi các kỹ năng lập trình và công nghệ sẽ cần thiết!"
  }
}