{
  "ABOUT": {
    "HERO_TITLE": "O MNĚ",
    "INTRO_H1": "Úvodní slovo",
    "INTRO_P": "Ahoj návštěvníci, jmenuji se Hải Hà (přátelé mě znají jako Haiko, a proto tedy název tohoto blogu). Jsem původem z Vietnamu 🇻🇳, tedy ze země, kterou mnozí znají především z amerických filmů, obvykle spojovaných s válkou ⚔️. Poslední dobou je Vietnam však považován za jedno z nejzajímavějších míst v jihovýchodní Asii, a to díky především velmi krásné přírodě a chutnému jídlu. Ano, Vietnam je taky domovem populární polévky „PHO“ 🍜!  Tato země se taky pyšní velmi krásnou krajinou, a proto zde byly natočeny mnoho slavných filmů. Mezi poslední lze např. vyjmenovat „Kong: Ostrov lebek“.",
    "MY_STORY_H1": "Můj příběh",
    "MY_STORY_P": "Narodil jsem se ve Vietnamu v roce 1987 a do svých pěti let, jsem vyrůstal v Hanoji. V roce 1993, jsem se přestěhoval do České republiky se svými rodiči, a od té doby žijeme v hlavním městě, v Praze. A proč zrovna v Praze? Protože, se zde moji rodiče do sebe zamilovali a následně se vzali. V roce 1986 se přestěhovali zpět do Vietnamu, ale postupně zjistili, že ve srovnání s tehdejším Česko-Slovenskem, se tamní život až tolik nezměnil. Ekonomická situace Vietnamu na konci 80-tých let na tom nebyla taky zrovna nejlépe, a jelikož oba zažili v Praze velmi krásné vzpomínky, rozhodli se sem vrátit, jakmile se naskytla možnost. Chtěl bych však zde upozornit, že můj případ není nijak ojedinělý. Znám mnoho kamarádů a vrstevníků, kteří sdílejí se mnou podobný příběh. Obdobně jako já se do Čech přestěhovali se svými rodiči, kteří nejspíše během 70-tých a 80-tých letech v Česko-Slovensku pracovali nebo studovali v rámci RVHP. Vzpomínám si na první den, kdy jsem přijel do Prahy, bylo to v zimě na začátku roku 1993 (leden nebo únor), bylo to poprvé, co jsem viděl sníh ❄️. I přesto, že byla strašná zima, tak se mi strašně líbilo a nikdy nezapomenu na okamžik.  \n",
    "MY_STORY_P2": "V prvních měsících v Čechách jsem strávil každý den u své ¨České babičky¨, neboli mé České chůvy. Měli jsme to štěstí, že jsme měli skvělý sousedy a tato postarší paní přijala návrh mého otce se stát mojí chůvou. Každý den mě chovala, vařilo české jídlo a učila česká slovíčka, a vlastně postupně jsem se takto naučil mluvit česky😀. Byl jsem vzděláván jako každé jiné české dítě a díky podpoře mých rodičů se mi podařilo projít všemi hlavními typy českého vzdělávacího systému. Ve škole a vlastně během každodenního života, jsem měl příležitost se dozvědět více o kultuře, historii a Českých zvyků. \n",
    "MY_STORY_P3": "Doma jsem byl zas vzděláván vietnamskou kulturou, historií a zvyky. Veškerá komunikace u nás doma probíhala ve Vietnamštině, takže jsem měl to štěstí, že jsem nezapomněl na svůj rodný jazyk. V roce 1995, pozvali moji rodiče mého strýce Nama(staršího bratra mé matky) z Vietnamu, který u nás zůstal až do roku 1998, poté se kvůli rodinným záležitostem musel přestěhovat zpět do Hanoje. Původně jsme chtěli vydělat dostatečně peněz a postupně pozvat i mojí teto Cham a také mé sestřenice, ale občas i když v životě něco plánujete důkladně, tak to prostě nevyjde.",
    "MY_STORY_P4": "Jak se říká: „Život je jako jízda na horské dráze…. jednou jsme dole, po druhý nahoře.“ , až do Vánoc roku 2014. Pro mě to byly obvykle vzestupy, mezi tu a tam jsem někdy něco pokazil, nebo by rodičovská věc nefungovala dobře (a ano, podnikání Vietnamci od padesátých let do padesátých let byli obecně velmi špatní, obvykle bychom podnikali, například prodávali levné oblečení jako alternativu pro české občany, protože jsme si nemohli dovolit platit za značkové oblečení, nebo bychom pracovali jako levná pracovní síla v továrnách, což byla hlavní důvod, proč Vietnamci skutečně přišli do Čech v 50. letech, ale více o tomto tématu v jiném příspěvku). Zpět k věci, žádný z našich neúspěchů by nebyl spojen se zdravím, což je ve skutečnosti to nejcennější, co dnes každý z nás má. Pokud jsme zdraví, můžeme dělat, co chceme, pokud nám to naše životnost může nabídnout. Začalo to tedy prostým kašlem na mého otce a nakonec mu byla diagnostikována rakovina plic, nejprve se před mnou a mámou snažil skrýt, ale nakonec mi to řekl. Abych byl upřímný, řekl jsem, že jsem začal googlovat věci o jeho příznacích, a tohle něco nového se blíží, ale stále to pro mě byl šok, když mi můj otec řekl pravdu a důvod, proč se to snažil držet dál já a máma. Řekl mi, že se bál, že moje matka bude schopna snést pravdu, a on si myslel, že se zhroutí. Chtěl tedy, abych tajemství před mojí matkou uchoval co nejdéle. V zásadě se připravoval na nejhorší, emocionálně jsem silnější a celkem se mu to povedlo, protože dnes už vůbec neplaču, to bylo kritické, když jsem to konečně řekl mámě v prosinci 2015, pouhé tři měsíce ode dne, kdy můj táta zemřel. Když jsem mámě řekl pravdu, byla opravdu smutná, ale tak trochu to ví celou dobu, řekla mi, že je zvědavá, zkontrolovala na internetu příznaky mého otce a také se zeptala svých přátel, kteří jsou lékaři. Vzala to opravdu s odvahou a během několika posledních měsíců jsem ji zřídka viděl plakat. Můj táta zemřel 3. března 2016, bojoval s nemocí statečně dva roky. Byly to nejsmutnější dva roky v mém životě, ale také mi to otevřelo oči a dalo mi vědět, co je pro mě v životě opravdu důležité, a myslím, že od té chvíle se od té doby skutečně stanu dospělým mužem.\n",
    "WHAT_I_LIKE_H1": "Co mám rád",
    "WHAT_I_LIKE_P": "Existuje spousta věcí, které mě baví, ale určitě by byly na mém seznamu:",
    "GAMES_AND_COMPUTERS_H2": "Videohry a počítače",
    "GAMES_AND_COMPUTERS_P": "Když jsem vyrůstal v České republice, měl jsem to štěstí, že jsem se v raném věku dostal do kontaktu s Tech. Moje první Tech byla určitě kopie systému 🎮NES od Nintenda, který můj otec koupil na mé 7. narozeniny. Tímto systémem jsem se seznámil s videohrami, strávil jsem bezpočet hodin nad hrami jako Super Mario Bros, Tetris, Contra, Tanks a všemi klasikami systému dostupnými na českém trhu. Díky svým přátelům jsem byl také seznámen s Windows 95 a později 98. Ne to dítě, jako jsme my, dostalo příležitost pracovat s počítači, ale jejich rodiče se na ně obvykle spoléhají a my jsme se náhodou proplížili a hráli hry na počítačích. Rok 1995 byl rokem, kdy jsem byl představen Internetu a World Wide Web. První stránka, kterou mi můj přítel ukázal, byla www.seznam.cz, která věří, že dnes v Čechách stále existuje. Pokud nemáte tušení, je to česká verze představivosti „Google“, tedy v podstatě fulltextový vyhledávač. Bože, připomíná mi to staré časy kabelového pomalého telefonního připojení, které dosahuje rychlosti 5 kb / s 😱! Já a moji přátelé jsme zvládli všechny slavné hry této doby, jako jsou Prince of Persia, Doom, Duke Nukem 3D, Mortal Kombat a tak dále. Rok 1996 byl také rokem, kdy jsem poprvé viděl v obchodě se svým otcem slavnou Sony Playstation One, člověče, nikdy jsem nezapomněl na ten pocit, vidět a hrát takové pokrokové hry, tolik jsem chtěl, ale neměli jsme dost peněz, konzole byla opravdu drahá (500 USD, myslím, že dnes by to stálo 700 USD kvůli inflaci nebo více). Můj táta slíbil, že mi to do dvou let koupí, a udělal to. Ten můj jsem dostal v říjnu 1998 jako dárek k narozeninám. Věřte mi, Playstation Nation ve mně teče až do tohoto bodu! Jako dítě jsem po škole chtěl dělat jen to, že jsem šel do domu mého přítele a hrát jejich hry 😀, protože jsme v našem domě nevlastnili počítač. Alespoň ne do roku 2001, kdy jsem dostal svůj první jako dárek k narozeninám 😍! Teď jsem konečně nemusel trávit hodiny hraním u mého přítele, místo toho přišli ke mně, protože najednou jsem měl v kapuci to nejnovější a nejlepší 😎! Díky zkušenostem v domech mého přítele jsem se naučil používat Windows, moje verze byla Millennium Edition, o které jsem si nejdříve myslel, že je skvělá, dokud jsem nenainstaloval XP 🙈!",
    "GAMES_AND_COMPUTERS_P2": "Během vysoké školy mi byl představen Mac a iPhone od některých mých spolužáků, kterým se podařilo tyto hračky přivést z USA. Ano, byl to rok 2007, kdy Steve Jobs představil původní iPhone. Jde o to, že až do tohoto okamžiku nebyl Apple v České republice tak běžný a všichni moji přátelé mají obvykle Windows a chytrý telefon se systémem Windows nebo dokonce Symbian od Nokie, jo. Také jsem si myslel, že Windows a PC jsou stále lepší než MAC a Windows navíc podporují více her! IPhone byl jiný příběh, až do tohoto okamžiku jsem si nic nepamatoval, vzpomínám si, že se mi to opravdu líbilo, ale jediná věc, která mě držela stranou, byla opět cena, a protože jsem zatím neměl tušení o filozofii Apple, myslel jsem si naivně, že to bylo v podstatě předražené. Ať tak či onak, dělal jsem vedlejší práce, abych ušetřil peníze na nákup mého prvního iPhonu, ale když jsem dostal své peníze, rozhodl jsem se po všech recenzích a zdravém rozumu dát své peníze do: hádej co ?, Windows Phone, slavný HTC Diamond 2. Totéž se stalo, když jsem byl představen iPadu 2, věděl jsem, že ho tolik chci, ale nakonec jsem místo toho koupil Galaxy Tab, jo OMG! Dlouhý příběh, krátký, velmi dlouho jsem věřil, že Apple je předražený, a měl bych své peníze investovat do alternativ, které mi poskytnou stejný výkon za nižší cenu, i když se mi produkty líbily. Nejlepší rána pro vaše peníze, jak se říká, a to byl důvod, proč jsem tak dlouho zůstal v ekosystému Apple. Trochu vím, že v Tech někdy výkon ≠ kvalita. Což je stejné pro Windows vs Mac nebo Android vs iOS.",
    "GAMES_AND_COMPUTERS_P3": "Až do roku 2013, kdy bylo pro iPad Mini 2 opravdu hodně, jsem opravdu chtěl nahradit svůj starý Nexus 7. Nakonec jsem to koupil a to nakonec změnilo názor na produkty Apple. IOS byl opravdu hladký, byly aplikace, na kterých mi opravdu záleží, a tyto aplikace nebyly k dispozici ani pro Android. Všechno prostě funguje a já jsem nemusel strávit nespočet hodin učením se, jak ROOTOVAT telefon a fungovat tak, jak jsem chtěl.",
    "GAMES_AND_COMPUTERS_P4": "Dalším milníkem pro mě byl podzim roku 2013, kdy jsem svému příteli pomohl koupit MacBook Pro 2013 Late Edition, dostal jsem šanci pomoci mu s nastavením a nějak jsem to opravdu chtěl. Moje stará pracovní plocha pro PC byla opravdu pomalá a chtěl jsem nový stroj. V den svých narozenin jsem ušetřil všechny peníze a koupil svůj první MacBook Pro 15 \"se špičkovými specifikacemi. Prvních pár dní jsem si dokonce myslel, že jsem udělal nejhorší chybu v životě, když jsem utratil tolik peněz za notebook 🙈! „Mohl bych utratit méně nebo za stejnou cenu koupit špičkovou pracovní plochu počítače PC. Jsem tak rád, že jsem se rozhodl, protože stroj fungoval jako drahokam! Nedávno jsem jej prodal za cenu, kterou byste nikdy nedostali pro notebook na PC. To je na produktech Apple další věc, zachovávají si svoji hodnotu po velmi dlouhou dobu! Po Macu jsem byl úplně závislý a všechny ostatní produkty Apple by mě následovaly 🙈! Přečetl jsem si všechny věci tam je o historii a filozofii Apple, a já jsem zjistil, že mám podobný způsob myšlení, a opravdu se mi líbí značka! Stal jsem se doslova „iSheep“ 🙈!",
    "GAMES_AND_COMPUTERS_P5": "Jak vidíte, byl jsem silně inspirován videohrami a až do tohoto okamžiku je to jeden z mých koníčků, který se mi opravdu líbí. Dnes už bohužel nemám tolik času, ale když ano, můžu si opravdu užít hraní nejnovějšího hitu! U počítačů jsem opravdu vděčný za to, co Steve Jobs a Apple udělali pro technologický svět a lidstvo!",
    "PHOTOGRAPHY_H2": "Fotografování",
    "PHOTOGRAPHY_P1": "Na Fotografii bylo vždy něco, co se mi líbilo. Ať už je to estetika nebo samotné vyprávění. Cestu jsem zahájil v roce 2003, kdy jsem poprvé koupil svůj digitální fotoaparát se 128 MB pamětí, byla to levná značka bez názvu, ale pro mé účely dostačující a utratil jsem všechny peníze, které jsem si musel dovolit. Měl pouze 3,2 MPX snímač, na kterém byl namontován levný objektiv. Mělo to několik polomanuálních funkcí, ale neměl jsem vůbec žádnou představu, v podstatě point & shoot, který mě naštartoval. Jako každý průměrný Joe jsem neměl tušení o pojmech jako ZÁVĚRKA, APERTURA, ISO, EXPOZICE atd. Moje obrázky byly hrozné, ale prostě se mi líbily!",
    "PHOTOGRAPHY_P2": "V roce 2010, během vysokoškolských dnů, jsem se díky internetu a Lynda.com začal více profesionálně učit o FOTOGRAFII a začal jsem se opravdu zajímat. Rozhodl jsem se ušetřit všechny své peníze z práce na částečný úvazek, kterou jsem dělal, a na moje narozeniny jsme si s tátou koupili svou první digitální jednookou zrcadlovku od Canon, notoricky známého Canon 50D, s „Plastic, Fantastic“ 50- Objektiv mm F1,8. Toto bylo zabijácké kombo a moje obrázky se pomalu zlepšovaly, já jsem se více soustředil na portrétování a dokonce jsem se chtěl stát profesionálním fotografem a začít natáčet svatby na živobytí. Tento sen byl promarněn, když byl náš byt během dne okraden. Bydleli jsme v jedné z nejhorších pražských čtvrtí od roku 1995 a tyto věci byly normální, slyšeli jsme o tom ve zprávách a televizi, ale nikdy si nepředstavujte, že by se nám to stalo. Naštěstí nikdo z nás nebyl srdcem, nebyli jsme doma, když se to stalo! Ztratili jsme asi 6000 USD majetku, vybavení mé kamery, věcí atd. Policie nám řekla, že je to normální a je nepravděpodobné, že by je chytili, a nikdy se to nestalo. Musel jsem přestat sledovat svůj sen stát se profesionálním fotografem 😭! Stále jsem fotografoval se svým Galaxy Note 2, Samsung měl opravdu skvělé fotoaparáty a zdá se, že to dělají i dnes 😝! David, můj dobrý přítel ze střední školy, byl ten, kdo mi představil tvorbu videa a já jsem se začal učit na svých vlastních střihových videích v Premiere Pro (jo, to bylo před mým MAC 😝!)\n",
    "PHOTOGRAPHY_P3": "Nakonec jsem znovu ušetřil peníze a koupil jsem Canon 600d s „Nifty, Fifty“ znovu 😝! Teď jsem dokonce měl nějaké znalosti o tvorbě videí, a tak jsem začal dělat úpravy svých vlastních klipů. Během vysoké školy jsem se zapsal do kurzu „Vizuální komunikace“, který na Vysoké škole ekonomické v Praze vyučoval profesor Horny, byla to skvělá zkušenost a tak jsem se do toho zapojil! Už pro mě jako svatební fotografa nebyly příležitosti, a i kdyby tam byly, neměl jsem už žádné správné vybavení (jako blesky, soft-boxy, stojany atd.). Moje loajalita vůči společnosti Canon netrvala dlouho, protože v únoru 2015 jsem se rozhodl skočit na loď, prodal jsem veškerou svou výbavu Canon, což byl pouze Canon 600D a 50 mm F1.8, a koupil jsem Sony A6000, který byla úžasná kamera. Více o mé recenzi najdete na stránce BLOG.\n",
    "PHOTOGRAPHY_P4": "Úplně přestávám zdokonalovat své dovednosti ve tvorbě FOTOGRAFIE a FILMU, protože v roce 2015 byl můj táta už opravdu slabý, musel pravidelně navštěvovat lékaře. Když už nebyl schopen chodit, pravidelně jsme ho s mamkou navštěvovali. Chemoterapii užil pouze jednou, pozdější dávky už neměly žádný účinek, a tak se nakonec přesunul do sekce speciální péče, kde v podstatě zůstal, dokud nezemřel.",
    "PHOTOGRAPHY_P5": "Dnes stále miluji FOTOGRAFII, kromě PORTRAITURE jsem začal mít opravdu rád CESTOVNÍ FOTOGRAFIE a začal jsem se silně zaměřovat na tuto kategorii. Inspiruje mě slavná fotografka Elia Locardi. Kromě toho jsem začal fotit také VLOGY, obvykle o CESTOVÁNÍ. Inspiroval mě slavný Casei Neistat.",
    "PHOTOGRAPHY_P6": "Nevím, jestli bych fotil svatby, ale fotím dál 😝!\n",
    "TRAVEL_AND_CUISINE_H2": "Cestování a kuchyně",
    "TRAVEL_AND_CUISINE_P": "Když můj táta zemřel v roce 2016, utratil jsem všechny své úspory za cestování. Zajímavé je, že jsem nikdy předtím tolik necestoval, ve skutečnosti to nebylo něco, co by mě potěšilo, takže jsem tomu ani nevěnoval pozornost. Raději bych utratil peníze za nějakou technickou nebo videohru, ale když můj táta zemřel, chtěl jsem jen cestovat, abych zapomněl na skutečnost, že už s námi není. Nejprve jsem začal cestovat s několika přáteli, nakonec jsem zvládl cestování SOLO a začal jsem cestovat sám.",
    "TRAVEL_AND_CUISINE_H3": "Podařilo se mi navštívit tyto země:",
    "TRAVEL_AND_CUISINE_P2": "A co kuchyně v nadpisu, na kterou se můžete zeptat? No, vždycky jsem byl nadšený jídlem, které vařila moje máma a táta, ale když jsem začal cestovat, to byl ten pravý okamžik, kdy jsem opravdu našel vášeň v vychutnávání jídla po celém světě. Kromě toho musí člověk jíst, že?",
    "WEB_DEVELOPMENT_H2": "Webový vývoj",
    "WEB_DEVELOPMENT_P1": "Moje vášeň pro web začala již v roce 1995, kdy mi můj přítel poprvé ukázal vyhledávač SEZNAM. Jako všichni ostatní, i já jsem byl závislý na používání webu, zejména při hledání informací, chatování, hraní her a poslechu hudby. V zásadě jsem to používal jako všichni ostatní, ale nikdy mě nenapadlo, že jednoho dne budu vytvářet aplikace na WEBu.",
    "WEB_DEVELOPMENT_P2": "Je škoda, že jsem se k tomuto tématu dostal opravdu pozdě. Zvláště, když jsem měl svůj první počítač docela brzy. Myslím, že to souvisí s tím, že oba moji rodiče jsou netechničtí, a když jsem dokončil základní školu, neměl jsem v podstatě tušení, co budu dělat v budoucnu, a tak jsem se zapsal na obchodní akademii. Během mých čtyř let na střední škole probíhaly kurzy IT, ale většina z nich pouze učila práci s Microsoft Office. Co můžete od školy BIZ očekávat, že?",
    "WEB_DEVELOPMENT_P3": "Po střední škole jsem ještě neměl ponětí, co budu dělat, a protože ani moji rodiče ne, zeptali jsme se kolem a jedinou možností pro mě byla University of Economics nebo University of Life Science (wtf, dobře, je to nový název, bývala to zemědělská univerzita). Zajímavý fakt, nasával jsem matematiku, takže jsem se musel opravdu tvrdě učit, abych zvládl přijímací zkoušky.",
    "WEB_DEVELOPMENT_P4": "Bylo několik fakult, které jsem si mohl zvolit pro zápis do studia:",
    "WEB_DEVELOPMENT_LI1": "Fakulta mezinárodních vztahů (během mé doby byla nejžhavější)",
    "WEB_DEVELOPMENT_LI2": "Fakulta finančních studií (nejvhodnější pro mě z BIZ Academy)",
    "WEB_DEVELOPMENT_LI3": "Fakulta informatiky a statistiky (zde jsem skončil :-))",
    "WEB_DEVELOPMENT_P5": "Upřímně řečeno, mířil jsem na první dva, protože by to byla logická volba. Alespoň jsem si to naivně myslel 😝! Jde o to, že jsem neuspěl na přijímací zkoušce a zkoušky jsem musel dělat znovu během léta 2007. IT se mi vždy líbilo, s mým původem by to byla přirozená volba, ale znovu, protože jsem strávil čtyři roky učením BIZ a Ekonomie, myslel jsem si, že to bude ztráta času.",
    "WEB_DEVELOPMENT_P6": "Naštěstí si myslím, že to byl můj osud, že jsem selhal na ostatních dvou fakultách, kvůli tomu jsem se musel zúčastnit FIT.",
    "WEB_DEVELOPMENT_P7": "Strávil jsem 7 let dokončováním magisterského studia na mé fakultě, bylo to dlouhých 7 let, ale na ty okamžiky si budu vždy pamatovat. Za těch 7 let jsem se toho naučil tolik, legrační je, že jsem se naučil víc o životě samotném, než o tom, co bych dělal profesionálně. Na Ekonomické univerzitě tedy jde o to, že v bakalářském programu mají všichni studenti, bez ohledu na to, ke které fakultě patří, společné kurzy, například:",
    "WEB_DEVELOPMENT_LI4": "Ekonomie",
    "WEB_DEVELOPMENT_LI5": "Statistika",
    "WEB_DEVELOPMENT_LI6": "Matematika",
    "WEB_DEVELOPMENT_LI7": "Účetnictví",
    "WEB_DEVELOPMENT_LI8": "Mezinárodní Ekonomie",
    "WEB_DEVELOPMENT_LI9": "atd",
    "WEB_DEVELOPMENT_P8": "Všechny zmíněné kurzy byly skvělé, tvrdé, ale skvělé, ale byly i jiné, které byly opravdu nudné a prostě jste je museli absolvovat. Můj první kontakt s programováním byl v prvním semestru, kdy nás naši učitelé seznámili s JAVOU, která měla být víceúčelovým jazykem. Jako JavaScript v dnešní době a trochu to tak bylo a stále je, ale je pravda, že přednášky byly tak nudné a opravdu těžké pro člověka, jako jsem já, pocházejícího z akademie BIZ, aby to pochopil. Nebyly to jejich chyby, byl to styl a způsob, jakým učili, jsem v učení jazyka neviděl žádný potenciál. Právě jsem zvládl složit zkoušky a bylo mi to jedno.",
    "WEB_DEVELOPMENT_LI10": "Head First HTML with CSS & XHTML (Book by Elisabeth Freeman and Eric Freeman)\n",
    "WEB_DEVELOPMENT_P9": "Upřímně řečeno, nikdy jsem si nemyslel, že se stanem webovým vývojářem kvůli mé historii s tématem. Bylo to těžké, nudné a čas, který jsem strávil tím, že jsem se něco naučil, nestál za to. Po BC programu se mi nepodařilo složit přijímací zkoušky na magisterské, takže jsem musel čekat 6 měsíců na další příležitost. Během této doby jsem měl možnost číst a dozvědět se o Web Development z této knihy:",
    "WEB_DEVELOPMENT_P10": "Skvělá kniha, byla to přednáška, na kterou jsem čekal, plná motivace, zábavy a zajímavého způsobu, jak učit, a v podstatě mě to chytilo. Pro nováčky tuto knihu naprosto doporučuji! Během magisterského studia jsem měl možnost se přihlásit na kurz Vývoj webových aplikací, takže díky mým zkušenostem z knihy jsem se už neztratil. Zde jsem dostal příležitost vytvořit svůj osobní web s CSS, HTML a PHP. Bohužel zde nebyl učen žádný JavaScript. Kurz se mi líbil, hodně mi dal. Po univerzitě jsem získal místo Junior Front-End vývojáře. Pak do jiné práce, kde jsem se dozvěděl o ReactJS, a zbytek si můžete přečíst v mém LinkedIn profilu zde.",
    "PURPOSE_OF_THIS_BLOG_H1": "Účel tohoto blogu",
    "PURPOSE_OF_THIS_BLOG_P1": "Když jsem založil tento blog, chtěl jsem se podělit o své znalosti o všech tématech, která jsem se během těch let naučil jako samouk. Chtěl jsem dát lidem jako já vědět o výzvách a výsledcích, kterých mohou dosáhnout, a pomoci jim je motivovat, jak mě motivovali všichni moji inspirovaní učitelé.",
    "PURPOSE_OF_THIS_BLOG_P2": "Dokonce i dnes je těžké, díky internetu se každý může naučit, co chce! Stále existuje segment lidí, kteří neumí anglicky a nemohou se učit z anglicky mluvících / psaných zdrojů. Legrační, že? Můj blog je také v angličtině, chci svůj blog lokalizovat i v budoucnu. Zpočátku chci pomáhat učit a sdílet své znalosti s mou vietnamskou komunitou žijící zde v Praze. Většina vietnamských lidí, kteří zde žijí, stále nemluví a neumí anglicky, takže bych jim chtěl pomoci dozvědět se více o technologických tématech a pracovních místech, která jsou dnes k dispozici. Připravte je na budoucnost, kde budou zapotřebí programovací a technické dovednosti!"
  }
}